###  Part # 1
  #### Terragrunt Format and Style 🖌`success`
  #### Terragrunt Initialization ⚙️`success`
  #### Terragrunt Validation 🤖`success`

  <details><summary>Validation Output</summary>

  ```
  Success! The configuration is valid.


  ```

  </details>

  #### Terragrunt Plan 📖`success`
  <details><summary>Show Plan</summary>

  ```
  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_route53_record.route53_records["_domainconnect.kolv.in_CNAME"] has been deleted
  - resource "aws_route53_record" "route53_records" {
      - fqdn    = "_domainconnect.kolv.in" -> null
      - id      = "Z08737401KPIKUPWNGX8Z__domainconnect.kolv.in_CNAME" -> null
      - name    = "_domainconnect.kolv.in" -> null
      - records = [
          - "_domainconnect.gd.domaincontrol.com.",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z08737401KPIKUPWNGX8Z" -> null
    }

  # aws_route53_record.route53_records["_sip._tls.@.kolv.in_SRV"] has been deleted
  - resource "aws_route53_record" "route53_records" {
      - fqdn    = "_sip._tls.@.kolv.in" -> null
      - id      = "Z08737401KPIKUPWNGX8Z__sip._tls.@.kolv.in_SRV" -> null
      - name    = "_sip._tls.@.kolv.in" -> null
      - records = [
          - "100 1 443 sipdir.online.lync.com.",
        ] -> null
      - ttl     = 300 -> null
      - type    = "SRV" -> null
      - zone_id = "Z08737401KPIKUPWNGX8Z" -> null
    }

  # aws_route53_record.route53_records["_sipfederationtls._tcp.@.kolv.in_SRV"] has been deleted
  - resource "aws_route53_record" "route53_records" {
      - fqdn    = "_sipfederationtls._tcp.@.kolv.in" -> null
      - id      = "Z08737401KPIKUPWNGX8Z__sipfederationtls._tcp.@.kolv.in_SRV" -> null
      - name    = "_sipfederationtls._tcp.@.kolv.in" -> null
      - records = [
          - "100 1 5061 sipfed.online.lync.com.",
        ] -> null
      - ttl     = 300 -> null
      - type    = "SRV" -> null
      - zone_id = "Z08737401KPIKUPWNGX8Z" -> null
    }

  # aws_route53_record.route53_records["autodiscover.kolv.in_CNAME"] has been deleted
  - resource "aws_route53_record" "route53_records" {
      - fqdn    = "autodiscover.kolv.in" -> null
      - id      = "Z08737401KPIKUPWNGX8Z_autodiscover.kolv.in_CNAME" -> null
      - name    = "autodiscover.kolv.in" -> null
      - records = [
          - "autodiscover.outlook.com.",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z08737401KPIKUPWNGX8Z" -> null
    }

  # aws_route53_record.route53_records["email.kolv.in_CNAME"] has been deleted
  - resource "aws_route53_record" "route53_records" {
      - fqdn    = "email.kolv.in" -> null
      - id      = "Z08737401KPIKUPWNGX8Z_email.kolv.in_CNAME" -> null
      - name    = "email.kolv.in" -> null
      - records = [
          - "email.secureserver.net.",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z08737401KPIKUPWNGX8Z" -> null
    }

  # aws_route53_record.route53_records["kolv.in_A"] has been deleted
  - resource "aws_route53_record" "route53_records" {
      - fqdn    = "kolv.in" -> null
      - id      = "Z08737401KPIKUPWNGX8Z_kolv.in_A" -> null
      - name    = "kolv.in" -> null
      - records = [
          - "76.76.21.21",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z08737401KPIKUPWNGX8Z" -> null
    }

  # aws_route53_record.route53_records["kolv.in_MX"] has been deleted
  - resource "aws_route53_record" "route53_records" {
      - fqdn    = "kolv.in" -> null
      - id      = "Z08737401KPIKUPWNGX8Z_kolv.in_MX" -> null
      - name    = "kolv.in" -> null
      - records = [
          - "0 kolv-in.mail.protection.outlook.com.",
        ] -> null
      - ttl     = 300 -> null
      - type    = "MX" -> null
      - zone_id = "Z08737401KPIKUPWNGX8Z" -> null
    }

  # aws_route53_record.route53_records["kolv.in_TXT"] has been deleted
  - resource "aws_route53_record" "route53_records" {
      - fqdn    = "kolv.in" -> null
      - id      = "Z08737401KPIKUPWNGX8Z_kolv.in_TXT" -> null
      - name    = "kolv.in" -> null
      - records = [
          - "NETORGFT11360354.onmicrosoft.com",
          - "v=spf1 include:secureserver.net -all",
        ] -> null
      - ttl     = 300 -> null
      - type    = "TXT" -> null
      - zone_id = "Z08737401KPIKUPWNGX8Z" -> null
    }

  # aws_route53_record.route53_records["lyncdiscover.kolv.in_CNAME"] has been deleted
  - resource "aws_route53_record" "route53_records" {
      - fqdn    = "lyncdiscover.kolv.in" -> null
      - id      = "Z08737401KPIKUPWNGX8Z_lyncdiscover.kolv.in_CNAME" -> null
      - name    = "lyncdiscover.kolv.in" -> null
      - records = [
          - "webdir.online.lync.com.",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z08737401KPIKUPWNGX8Z" -> null
    }

  # aws_route53_record.route53_records["msoid.kolv.in_CNAME"] has been deleted
  - resource "aws_route53_record" "route53_records" {
      - fqdn    = "msoid.kolv.in" -> null
      - id      = "Z08737401KPIKUPWNGX8Z_msoid.kolv.in_CNAME" -> null
      - name    = "msoid.kolv.in" -> null
      - records = [
          - "clientconfig.microsoftonline-p.net.",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z08737401KPIKUPWNGX8Z" -> null
    }

  # aws_route53_record.route53_records["sip.kolv.in_CNAME"] has been deleted
  - resource "aws_route53_record" "route53_records" {
      - fqdn    = "sip.kolv.in" -> null
      - id      = "Z08737401KPIKUPWNGX8Z_sip.kolv.in_CNAME" -> null
      - name    = "sip.kolv.in" -> null
      - records = [
          - "sipdir.online.lync.com.",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z08737401KPIKUPWNGX8Z" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.route53_records["_domainconnect.kolv.in_CNAME"] will be created
  + resource "aws_route53_record" "route53_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_domainconnect.kolv.in"
      + records         = [
          + "_domainconnect.gd.domaincontrol.com.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z08737401KPIKUPWNGX8Z"
    }

  # aws_route53_record.route53_records["_sip._tls.@.kolv.in_SRV"] will be created
  + resource "aws_route53_record" "route53_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_sip._tls.@.kolv.in"
      + records         = [
          + "100 1 443 sipdir.online.lync.com.",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = "Z08737401KPIKUPWNGX8Z"
    }

  # aws_route53_record.route53_records["_sipfederationtls._tcp.@.kolv.in_SRV"] will be created
  + resource "aws_route53_record" "route53_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_sipfederationtls._tcp.@.kolv.in"
      + records         = [
          + "100 1 5061 sipfed.online.lync.com.",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = "Z08737401KPIKUPWNGX8Z"
    }

  # aws_route53_record.route53_records["autodiscover.kolv.in_CNAME"] will be created
  + resource "aws_route53_record" "route53_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "autodiscover.kolv.in"
      + records         = [
          + "autodiscover.outlook.com.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z08737401KPIKUPWNGX8Z"
    }

  # aws_route53_record.route53_records["email.kolv.in_CNAME"] will be created
  + resource "aws_route53_record" "route53_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "email.kolv.in"
      + records         = [
          + "email.secureserver.net.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z08737401KPIKUPWNGX8Z"
    }

  # aws_route53_record.route53_records["kolv.in_A"] will be created
  + resource "aws_route53_record" "route53_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "kolv.in"
      + records         = [
          + "76.76.21.21",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z08737401KPIKUPWNGX8Z"
    }

  # aws_route53_record.route53_records["kolv.in_MX"] will be created
  + resource "aws_route53_record" "route53_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "kolv.in"
      + records         = [
          + "0 kolv-in.mail.protection.outlook.com.",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = "Z08737401KPIKUPWNGX8Z"
    }

  # aws_route53_record.route53_records["kolv.in_TXT"] will be created
  + resource "aws_route53_record" "route53_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "kolv.in"
      + records         = [
          + "NETORGFT11360354.onmicrosoft.com",
          + "v=spf1 include:secureserver.net -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z08737401KPIKUPWNGX8Z"
    }

  # aws_route53_record.route53_records["lyncdiscover.kolv.in_CNAME"] will be created
  + resource "aws_route53_record" "route53_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "lyncdiscover.kolv.in"
      + records         = [
          + "webdir.online.lync.com.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z08737401KPIKUPWNGX8Z"
    }

  # aws_route53_record.route53_records["msoid.kolv.in_CNAME"] will be created
  + resource "aws_route53_record" "route53_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "msoid.kolv.in"
      + records         = [
          + "clientconfig.microsoftonline-p.net.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z08737401KPIKUPWNGX8Z"
    }

  # aws_route53_record.route53_records["sip.kolv.in_CNAME"] will be created
  + resource "aws_route53_record" "route53_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sip.kolv.in"
      + records         = [
          + "sipdir.online.lync.com.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z08737401KPIKUPWNGX8Z"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ hosted_zones_records = {
      ~ "_domainconnect.kolv.in_CNAME"         = {
          ~ allow_overwrite                  = null -> (known after apply)
          ~ fqdn                             = "_domainconnect.kolv.in" -> (known after apply)
          ~ id                               = "Z08737401KPIKUPWNGX8Z__domainconnect.kolv.in_CNAME" -> (known after apply)
            name                             = "_domainconnect.kolv.in"
            # (12 unchanged elements hidden)
        }
      ~ "_sip._tls.@.kolv.in_SRV"              = {
          ~ allow_overwrite                  = null -> (known after apply)
          ~ fqdn                             = "_sip._tls.@.kolv.in" -> (known after apply)
          ~ id                               = "Z08737401KPIKUPWNGX8Z__sip._tls.@.kolv.in_SRV" -> (known after apply)
            name                             = "_sip._tls.@.kolv.in"
            # (12 unchanged elements hidden)
        }
      ~ "_sipfederationtls._tcp.@.kolv.in_SRV" = {
          ~ allow_overwrite                  = null -> (known after apply)
          ~ fqdn                             = "_sipfederationtls._tcp.@.kolv.in" -> (known after apply)
          ~ id                               = "Z08737401KPIKUPWNGX8Z__sipfederationtls._tcp.@.kolv.in_SRV" -> (known after apply)
            name                             = "_sipfederationtls._tcp.@.kolv.in"
            # (12 unchanged elements hidden)
        }
      ~ "autodiscover.kolv.in_CNAME"           = {
          ~ allow_overwrite                  = null -> (known after apply)
          ~ fqdn                             = "autodiscover.kolv.in" -> (known after apply)
          ~ id                               = "Z08737401KPIKUPWNGX8Z_autodiscover.kolv.in_CNAME" -> (known after apply)
            name                             = "autodiscover.kolv.in"
            # (12 unchanged elements hidden)
        }
      ~ "email.kolv.in_CNAME"                  = {
          ~ allow_overwrite                  = null -> (known after apply)
          ~ fqdn                             = "email.kolv.in" -> (known after apply)
          ~ id                               = "Z08737401KPIKUPWNGX8Z_email.kolv.in_CNAME" -> (known after apply)
            name                             = "email.kolv.in"
            # (12 unchanged elements hidden)
        }
      ~ "kolv.in_A"                            = {
          ~ allow_overwrite                  = null -> (known after apply)
          ~ fqdn                             = "kolv.in" -> (known after apply)
          ~ id                               = "Z08737401KPIKUPWNGX8Z_kolv.in_A" -> (known after apply)
            name                             = "kolv.in"
            # (12 unchanged elements hidden)
        }
      ~ "kolv.in_MX"                           = {
          ~ allow_overwrite                  = null -> (known after apply)
          ~ fqdn                             = "kolv.in" -> (known after apply)
          ~ id                               = "Z08737401KPIKUPWNGX8Z_kolv.in_MX" -> (known after apply)
            name                             = "kolv.in"
            # (12 unchanged elements hidden)
        }
      ~ "kolv.in_TXT"                          = {
          ~ allow_overwrite                  = null -> (known after apply)
          ~ fqdn                             = "kolv.in" -> (known after apply)
          ~ id                               = "Z08737401KPIKUPWNGX8Z_kolv.in_TXT" -> (known after apply)
            name                             = "kolv.in"
            # (12 unchanged elements hidden)
        }
      ~ "lyncdiscover.kolv.in_CNAME"           = {
          ~ allow_overwrite                  = null -> (known after apply)
          ~ fqdn                             = "lyncdiscover.kolv.in" -> (known after apply)
          ~ id                               = "Z08737401KPIKUPWNGX8Z_lyncdiscover.kolv.in_CNAME" -> (known after apply)
            name                             = "lyncdiscover.kolv.in"
            # (12 unchanged elements hidden)
        }
      ~ "msoid.kolv.in_CNAME"                  = {
          ~ allow_overwrite                  = null -> (known after apply)
          ~ fqdn                             = "msoid.kolv.in" -> (known after apply)
          ~ id                               = "Z08737401KPIKUPWNGX8Z_msoid.kolv.in_CNAME" -> (known after apply)
            name                             = "msoid.kolv.in"
            # (12 unchanged elements hidden)
        }
      ~ "sip.kolv.in_CNAME"                    = {
          ~ allow_overwrite                  = null -> (known after apply)
          ~ fqdn                             = "sip.kolv.in" -> (known after apply)
          ~ id                               = "Z08737401KPIKUPWNGX8Z_sip.kolv.in_CNAME" -> (known after apply)
            name                             = "sip.kolv.in"
            # (12 unchanged elements hidden)
        }
    }

  ```

  </details>

  *Pusher: @kolvin, Action: `pull_request`, Working Directory: `route53/prod/global`, Workflow: `route53-prod-eu-west-1`*